Feature: Φίλτρα

- (Αs) Ως χρήστης πελάτης/επισκέπτης
- (In order to) Για να αναζητήσω ένα προϊόν που μ’ ενδιαφέρει
-	(I want to) Θέλω να κάνω αναζήτηση για ένα προϊόν χρησιμοποιώντας κάποιο από τα διαθέσιμα φίλτρα

Σενάριο 10.1 (Κάνοντας αναζήτηση με φίλτρο)

- (Given) Θεωρώντας ότι έχω επιλέξει μία κατηγορία προϊόντων και γνωρίζω κάποια από τα στοιχεία του προϊόντος που θέλω να αναζητήσω
- (When) Όταν πηγαίνω στον πίνακα “φίλτρα” κάτω από τον πίνακα κατηγορίες και κάνω κλικ στο φίλτρο που με βάση αυτό θέλω να γίνει η αναζήτηση του προϊόντος (π.χ. αν θέλω να ψάξω βιβλία ενός συγκεκριμένου εκδότη, πηγαίνω στο φίλτρο “εκδότη”)
- (Then) Τότε πρέπει να εμφανιστεί μια λίστα με επιλογές (π.χ με τους εκδότες) που τα προϊόντα τους είναι καταχωρήμενα στο σύστημα από τους χρήστες καταστήματα και ανταποκρίνονται σε αυτό το φίλτρο.
- (When) Όταν επιλέξω μία από τις επιλογές της λίστας (π.χ τον εκδότη που μ ενδιαφέρει)
- (Then) Τότε πρέπει να εμφανιστούν όλα τα προϊόντα που υπάρχουν καταχωρημένα στο σύστημα και αναντοκρίνονται σε αυτό το φίλτρο (π.χ από τον συγκεκριμένο εκδότη)

10.2 (Κάνοντας αναζήτηση με φίλτρο χωρίς αποτελέσματα)

- (Given) Δεδομένου ότι έχω επιλέξει μια κατηγορία προϊόντων, γνωρίζω κάποια από τα στοιχεία του προϊόντος που θέλω να αναζητήσω και έχω επιλέξει κάποιο φίλτρο για την αναζήτηση του προϊόντος.
- (When) Όταν κάνω αναζήτηση και δεν υπάρχουν συμβατά αποτελέσματα
- (Then) Τότε πρέπει να εμφανιστεί μήνυμα “δεν βρέθηκαν αποτελέσματα με αυτό το κριτήριο ”.

Σενάριο 10.3 (Κάνοντας αναζήτηση με συνδυασμό φίλτρων) 

- (Given) Θεωρώντας ότι έχω επιλέξει κατηγορία, έχω κάνει αναζήτηση για προϊόντα χρησιμοποιώντας κάποιο από τα διαθέσιμα φίλτρα και έχει εμφανίσει αποτελέσματα στην αναζήτηση.
- (When) Όταν πηγαίνω στον πίνακα με τα φίλτρα και κάνω κλικ σ’ ένα δεύτερο φίλτρο 
- (Then)Τότε εμφανίζει μια λίστα με τις διαθέσιμες επιλογές
- (When)Όταν κάνω κλικ σε μία επιλογή από αυτές που επιτρέπει το φίλτρο
- (Then)Τότε γίνεται ανανέωση στα αποτελέσματα της αναζήτησης
- (And)Και εμφανίζονται εκείνα τα προϊόντα που υπάρχουν καταχωρημένα στο σύστημα και ανταποκρίνονται στα δεδομένα από τον συνδυασμό των φίλτρων που έχω επιλέξει.
