Feature: Σχετικά προϊόντα

- (Αs) Ως χρήστης πελάτης
- (In order to) Για να ενημερωθώ και για άλλα προϊόντα σχετικά με το προϊόν της αναζήτησης που έκανα
- (Ι want to) Θέλω να ενημερωθώ και για άλλα προϊόντα που σχετίζονται με το προϊόν της αναζήτησης και πιθανόν να μ ενδιαφέρουν 

Σενάριο 11  (Προτεινόμενα προϊόντα σχετικά με την αναζήτηση)

- (Given) Θεωρώντας ότι έχω κάνει αναζήτηση προϊόντος, το σύστημα έχει εμφανίσει μια σειρά από αποτελέσματα και έχω επιλέξει το προϊόν που θέλω να δω.
- (When) Όταν πηγαίνω κάτω από το προϊόν που βλέπω στην σελίδα
- (Then)Τότε πρέπει να εμφανιστεί σ’ ένα πλαίσιο με τον τίτλο “σχετικά προϊόντα” προτάσεις που σχετίζονται με το προϊόν της αρχικής αναζήτησης.
