Feature: Διαθεσιμότητα προϊόντος

- (Αs) Ως χρήστης πελάτης/επισκέπτης
- (In order to) Για να γνωρίζω το απόθεμα ενός προϊόντος από τα καταστήματα που μπορεί να εξυπηρετήσει το σύστημα
- (Ι want to) Θέλω να ενημερωθώ για τη διαθεσιμότητα του προϊόντος.

Σενάριο 12.1  (Διαθεσιμότητα προϊόντος: “άμεσα διαθέσιμο”)

- (Given) Θεωρώντας ότι έχω κάνει αναζήτηση προϊόντος και το σύστημα έχει εμφανίσει μια σειρά από αποτελέσματα
- (When) Όταν κάνω κλικ στο προϊόν που μ ενδιαφέρει
- (Then) Τότε πρέπει να εμφανιστεί μια λίστα από καταστήματα που έχουν καταχωρήσει το προϊόν στο σύστημα.
- (And) Και δίπλα από το εκάστοτε κατάστημα πρέπει να εμφανίζει το μήνυμα “άμεσα διαθέσιμο”.

Σενάριο 12.2  (Διαθεσιμότητα προϊόντος: “κατόπιν παραγγελίας”)

- (Given) Θεωρώντας ότι έχω κάνει αναζήτηση προϊόντος και το σύστημα έχει εμφανίσει μια σειρά από αποτελέσματα
- (When) Όταν κάνω κλικ στο προϊόν που μ ενδιαφέρει 
- (Then) Τότε πρέπει να εμφανιστεί μια λίστα από καταστήματα που έχουν καταχωρήσει το προϊόν στο σύστημα.
- (And) Και δίπλα από το εκάστοτε καταστήματα εμφανίζει το μήνυμα “κατόπιν παραγγελίας”.
