Feature: Καλάθι αγορών

- (As) Ως χρήστης πελάτης
- (In order to) Για να περιηγηθώ στην πλατφόρμα ενώ έχω αποφασίσει να αγοράσω κάποιο προϊόν
- (Ι want to) Θέλω να προσθέσω το προϊόν αυτό στο καλάθι αγορών.

Σενάριο 13.1(Προσθήκη στο καλάθι αγορών)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να προσθέσω ένα προϊόν στο καλάθι αγορών 
- (When)  Όταν γράψω τον τίτλο του προϊόντος στην περιοχή της αναζήτησης
- (And) Και επιλέξω <<Αναζήτηση>>
- (And) Και εμφανιστεί το προϊόν στην οθόνη
- (And) Και επιλέξω το εικονίδιο του προϊόντος
- (Τhen) Τότε εμφανίζεται στην οθόνη το συγκεκριμένο προϊόν δίπλα από το οποίο υπάρχει η επιλογή <<Προσθήκη στο καλάθι>>.
- (When) Όταν επιλέξω <<Προσθήκη στο καλάθι>>
- (Then) Τότε εμφανίζεται στην οθόνη το καλάθι αγορών με το προϊόν σε αυτό.

Σενάριο 13.2(Καλάθι αγορών)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να δω τα προϊόντα που επέλεξα  να αγοράσω
- (When)  Όταν επιλέξω το εικονίδιο με το καρότσι πάνω δεξιά στην οθόνη
- (Τhen) Τότε εμφανίζονται στην οθόνη όλα τα επιλεγμένα προϊόντα.
