Feature: Αγαπημένα

- (As) Ως χρήστης πελάτης
- (In order to) Για να μην χρειάζεται να αναζητώ συνεχώς τα προϊόντα που με ενδιαφέρουν
- (Ι want to) Θέλω να προσθέτω τα προϊόντα αυτά στη λίστα με τα αγαπημένα.

Σενάριο 14.1( Προσθήκη στα Αγαπημένα προϊόντα)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να προσθέσω ένα προϊόν στα Αγαπημένα
- (When) Όταν γράψω τον τίτλο του προϊόντος στην περιοχή της αναζήτησης
- (And) Και επιλέξω <<Αναζήτηση>>
- (And) Και εμφανιστεί το προϊόν στην οθόνη
- (And) Και επιλέξω το εικονίδιο του προϊόντος
- (And) Και εμφανιστεί στην οθόνη το συγκεκριμένο προϊόν  όπου δίπλα υπάρχει η επιλογή <<Αγαπημένα>>
- (And)  Και επιλέξω <<Αγαπημένα>>
- (Then) Τότε εμφανίζονται στην οθόνη όλα τα αγαπημένα προϊόντα.

Σενάριο 14.2(Αγαπημένα προϊόντα)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να δω συγκεντρωμένα τα προϊόντα που με ενδιαφέρουν 
- (When) Όταν επιλέξω το εικονίδιο με την καρδιά πάνω δεξιά στην οθόνη
- (Τhen) Τότε εμφανίζονται στην οθόνη όλα τα αγαπημένα προϊόντα.
