Feature:Παραγγελίες χρηστών

- (As) Ως χρήστης κατάστημα
- (In order to) Για να εκτελέσω την παραγγελία
- (Ι want to) Θέλω να μπορώ να δω τις παραγγελίες που έχουν γίνει από το χρήστη πελάτη.

Σενάριο 15.1(Παραγγελίες)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης κατάστημα και θέλω να δω τις παραγγελίες που έχουν γίνει από τους χρήστες πελάτες
- (When) Όταν επιλέξω <<Παραγγελίες>>
- (Τhen) τότε εμφανίζονται στην οθόνη όλες οι παραγγελίες.

Σενάριο 15.2(Πληροφορίες Παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης κατάστημα και θέλω να δω τις πληροφορίες μιας παραγγελίας που έγινε από ένα χρήστη πελάτη
- (When) Όταν επιλέξω <<Παραγγελίες>>
- (And) Και εμφανιστούν όλες οι παραγγελίες στην οθόνη
- (And) Και επιλέξω την παραγγελία που θέλω να δω
- (Τhen) Τότε εμφανίζονται οι πληροφορίες της παραγγελίας.

Σενάριο 15.3  (Ολοκλήρωση παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης κατάστημα και θέλω να προχωρήσω στην ολοκλήρωση μιας παραγγελίας ενός πελάτη
- (When) Όταν επιλέξω “παραγγελίες”
- (And) Και εμφανιστούν όλες οι παραγγελίες στην οθόνη
- (And) Και επιλέξω την παραγγελία που θέλω να δω
- (Then) Τότε ανοίγει ένα παράθυρο που περίεχει όλα τα στοιχεία σχετικά με την αγορά του προϊόντος από τον πελάτη
- (When) Όταν κάνω κλικ στην επιλογή “επιβεβαίωση”
- (Τhen) Τότε πρέπει να εμφανιστεί μία ειδοποιήση ότι η παραγγελία ολοκληρώθηκε.
