Feature : Hλεκτρονική απόδειξη

- (Αs) Ως χρήστης πελάτης
- (In order to) Για να μπορώ να είμαι καλυμμένος σε περίπτωση σφάλματος του συστήματος ή του χρήστη κατάστημα
- (Ι want to) Θέλω να έχω ένα αποδεικτικό στοιχείο  για την αγορά που πραγματοποίησα

Σενάριο 16.1  (Αποστολή ηλεκτρονικής απόδειξης/κωδικός παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει παραγγελία ενός προϊόντος από ένα κατάστημα
- (When) Όταν πηγαίνω στο «προφίλ»(And) Και πηγαίνω στην ενότητα «εισερχόμενα μηνύματα»
- (Then) Τότε πρέπει να έχει αποσταλλεί ένα μήνυμα-κωδικός παραγγελίας για την επιτυχή πραγματοποίηση της αγοράς.

Σενάρια 16.2 (Εκτύπωση της ηλεκτρονικής απόδειξης/κωδικός παραγγελίας) 

- (Given) Θεωρώντας ότι έχω λάβει μήνυμα-ηλεκτρόνικη απόδειξη/κωδικός παραγγελίας για μία αγορά
- (When) Όταν πηγαίνω στο «προφίλ»
- (And) Και πηγαίνω στην ενότητα «εισερχόμενα μηνύματα»
- (And)  Και ανοίξω το μήνυμα(And) Και πατήσω την εντολή «εκτύπωση»
- (Then) Τότε πρέπει να εκτυπωθεί η ηλεκτρονική απόδειξη/κωδικός παραγγελίας ώστε να μπορώ να έχω το έγγραφο και σε έντυπη μορφή.
