Feature: Ακύρωση παραγγελίας

- (Αs) Ως χρήστης πελάτης
- (In order to) Για να υπάρχει η επιλογή ακύρωσης της παραγγελίας
-	(Ι want to) Θέλω να ακυρώσω την παραγγελία 

Σενάριο 17.1 (Ακύρωση παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει μία παραγγέλια και έχει αποσταλλεί ηλεκτρόνικη απόδειξη/κωδικός παραγγελίας στα εισερχόμενά μου
- (When) Όταν πηγαίνω στην ενότητα “προφίλ μου”
- (Then) Τότε στην υποενότητα “εισερχόμενα” έχω λάβει μήνυμα με τον κωδικό παραγγελίας
- (When) Όταν ανοίξω το μήνυμα
- (Then) Τότε πρέπει να εμφανιστούν πληροφορίες σχετικά με την παραγγελία
- (Αnd) Και την δυνατότητα για ακύρωση της παραγγελίας
- (When) Όταν κάνω κλικ στην επιλόγη “ακύρωση της παραγγελίας”
- (And) Και εμφανιστεί το μήνυμα η παραγγελία ακυρώθηκε επιτυχώς
- (Then) Τότε η παραγγελία ακυρώθηκε.

Σενάριο 17.2 (Αποτυχημένη ακύρωση παραγγελίας)

- (Given) Θεωρώντας ότι έχω λάβει μήνυμα με τον κωδικό παραγγελίας
- (When) Όταν ανοίξω το μήνυμα
- (Αnd) Και κάνω κλικ στην επιλογή “ακύρωση της παραγγελίας”
- (And) Και εμφανιστεί το μήνυμα “μη δυνατότητα ακύρωσης της παραγγελίας -  βλέπε όρους και προϋποθέσεις του καταστήματος”
- (When) Τότε η παραγγελία δεν ακυρώθηκε για λόγους πολιτικής του καταστήματος απ’ όπου έγινε η αγορά
- (Αnd) Και ένα ηλεκτρόνικο μήνυμα πρέπει να αποσταλεί στα εισερχόμενα του πελάτη με πληροφορίες σχετικα με την πολιτική ακύρωσης αγορών από το κατάστημα.



