Feature: Ενημέρωση ακύρωσης

- (Αs) Ως χρήστης Κατάστημα
- (In order to) Για να ενημερωθεί το κατάστημα για μία ακύρωση παραγγελίας
- (Ι want to) Θέλω να ενημερωθώ για την ακύρωση παραγγελίας του πελάτη

Σενάριο 18 (Ενημέρωση καταστήματος για ακύρωση παραγγελίας)

- (Given) Θεωρώντας ότι ο πελάτης έχει ακυρώσει μία παραγγελία επιτυχώς
- (When) Όταν πηγαίνω στην ενότητα “προφίλ”
- (And) Και επιλέγω την υποενότητα “μηνύματα”
- (Then) Τότε έχει αποσταλεί μια ειδοποίηση σχετικά με την ακύρωση της παραγγελίας από τον πελάτη.
