Feature: Αξιολόγηση προϊόντος

- (As) Ως χρήστης πελάτης
- (In order to) Για να αξιολογήσω το προϊόν το οποίο αγόρασα 
- (Ι want to) Θέλω να αφήσω κάποιο σχόλιο και να το βαθμολογήσω.

Σενάριο 19.1(Αξιολόγηση προϊόντος)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να αξιολογήσω ένα συγκεκριμένο προϊόν που αγόρασα
- (When) Όταν πληκτρολογήσω τον τίτλο του στην περιοχή της αναζήτησης
- (And) Και εμφανιστεί το συγκεκριμένο προϊόν 
- (And) Και επιλέξω την εικόνα του προϊόντος
- (Τhen) Τότε εμφανίζεται στην οθόνη το συγκεκριμένο προϊόν κάτω από το οποίο υπάρχει η δυνατότητα αξιολόγησης με τη μορφή σχόλιων και βαθμολόγηση με κλίμακα από το 1 ως 5.
- (When) Όταν  πληκτρολογήσω τα σχόλια 
- (And) και βαθμολογήσω από το 1 ως 5 
- (And) και επιλέξω <<Υποβολή>>
- (Then) τότε η αξιολόγησή μου έχει δημοσιευθεί.

Σενάριο 19.2( Αξιολόγηση από άλλους χρήστες)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να δω μια αξιολόγηση για ένα συγκεκριμένο προϊόν που αγόρασα
- (When) Όταν πληκτρολογήσω τον τίτλο του στην περιοχή της αναζήτησης
- (And) Και επιλέξω <<Αναζήτηση>>
- (And) Και εμφανιστεί το συγκεκριμένο προϊόν 
- (And) Και επιλέξω την εικόνα του προϊόντος
- (Τhen) Τότε εμφανίζεται στην οθόνη το συγκεκριμένο προϊόν κάτω από το οποίο υπάρχουν οι αξιολογήσεις άλλων χρηστών με τη μορφή σχόλιων και βαθμολόγηση με κλίμακα από το 1 ως 5.
