Feature: Ταυτοποίηση

- (As) Ως χρήστης πελάτης/κατάστημα/διαχειριστής/επισκέπτης
- (In order to) Για να εξερευνήσω τις δυνατότητες του συστήματος
- (Ι want to) Θέλω να πλοηγηθώ εντός της αρχικής σελίδας.

Σενάριο 1.1 (Είσοδος – χρήστη πελάτη)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα
- (When) Όταν πληκτρολογήσω το Όνομα χρήστη και τον Κωδικό μου 
- (And) Και επιλέξω Είσοδος
- (Τhen) Τότε πρέπει να εμφανιστεί η αρχική σελίδα του συστήματος.

Σενάριο 1.2 (Είσοδος – χρήστη κατάστημα/διαχειριστή)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα
- (When) Όταν πληκτρολογήσω το Όνομα χρήστη και τον Κωδικό μου 
- (And) Και επιλέξω Είσοδος
- (Τhen) Τότε το σύστημα πρέπει να αναγνωρίσει την ιδιότητά μου και έπειτα να εμφανιστεί η αρχική σελίδα του συστήματος.

Σενάριο 1.3 (Είσοδος – χρήστη επισκέπτη)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα και επιθυμώ μόνο την περιήγησή μου στο σύστημα είτε είμαι εγγεγραμμένος χρήστης είτε όχι
- (When) Όταν επιλέξω << Είσοδος Επισκέπτη>>
- (Τhen) Τότε πρέπει να εμφανιστεί η αρχική σελίδα του συστήματος.

Σενάριο 1.4 (Είσοδος – Ξεχάσατε τον κωδικό σας)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα και ξεχάσω το Όνομα χρήστη ή τον Κωδικό μου
- (When)  Όταν επιλέξω <<Ξεχάσατε τον κωδικό σας>>
- (Τhen) Τότε πρέπει να εμφανιστεί σελίδα επανάκτησης του κωδικού μου.

Σενάριο 1.5 (Είσοδος – Εγγραφή νέου χρήστη)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα και δεν είμαι εγγεγραμμένος χρήστης
- (When) Όταν επιλέξω <<Εγγραφή>>
- (Τhen) Τότε πρέπει να εμφανιστεί η σελίδα της εγγραφής νέου χρήστη.

Σενάριο 1.6 (Αποτυχία ταυτοποίησης)

- (Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα
- (When) Όταν πληκτρολογήσω το Όνομα χρήστη και τον Κωδικό μου 
- (And) Και επιλέξω Είσοδος
- (And) Και δεν μπορεί να γίνει ταυτοποίηση του χρήστη
- (Τhen) Τότε πρέπει να εμφανιστεί ένα μήνυμα πως η είσοδος απέτυχε και δόθηκε λάθος όνομα χρήστη ή κωδικός.
