Feature: Αξιολόγηση καταστήματος

- (As) Ως χρήστης πελάτης
- (In order to) Για να αξιολογήσω το χρήστη κατάστημα για τις παρεχόμενες υπηρεσίες του
- (Ι want to) Θέλω να μπορώ να αφήσω κάποιο σχόλιο και να το βαθμολογήσω.

Σενάριο 20.1 (Αξιολόγηση χρήστη κατάστημα)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να αξιολογήσω τις υπηρεσίες του χρήστη κατάστημα
- (When) Όταν επιλέξω <<Καταστήματα >>
- (And) Και εμφανιστούν στην οθόνη όλα τα καταστήματα
- (And) Και επιλέξω το κατάστημα που θέλω να αξιολογήσω
- (Τhen) Τότε εμφανίζονται στην οθόνη πληροφορίες για το συγκεκριμένο κατάστημα και πιο κάτω υπάρχει η δυνατότητα αξιολόγησης με μορφή σχόλιων και βαθμολόγηση από το 1 ως 5.
- (When) Όταν γράψω τα σχόλια 
- (And) Και βαθμολογήσω από το 1 ως 5
- (And) Και επιλέξω <<Υποβολή>>
- (Then) Τότε η αξιολόγηση έχει δημοσιευτεί. 

Σενάριο 20.2 (Αξιολόγηση χρήστη κατάστημα από άλλους χρήστες)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα ως χρήστης πελάτης και θέλω να δω τις αξιολογήσεις των άλλων χρηστών για το χρήστη κατάστημα
- (When) Όταν επιλέξω <<Καταστήματα >>
- (And) Και εμφανιστούν στην οθόνη όλα τα καταστήματα
- (And) Και επιλέξω το κατάστημα που θέλω να δω
- (Τhen) Τότε εμφανίζονται στην οθόνη πληροφορίες για το συγκεκριμένο κατάστημα και πιο κάτω οι αξιολογήσεις των άλλων χρηστών με μορφή σχόλιων και βαθμολόγηση από το 1 ως 5.
