Feature : Newsletter

- (As) Ως χρήστης πελάτης
- (In order to) Για να λαμβάνω τις προσφορές των προϊόντων από το σύστημα
- (Ι want to) Θέλω να δέχομαι ενημερωτικό ηλεκτρονικό μήνυμα στο προσωπικό μου λογαριασμό.

Σενάριο 21.1 (Ενημερωτικό έντυπο)

- (Given) Θεωρώντας ότι έχω κάνει εγγραφή στο σύστημα
- (When) Όταν υπάρχουν νέες προσφορές  κάθε 15 ημέρες
- (And) και γίνεται αυτόματα αποστολή του newsletter σε όλους τους εγγεγραμμένους χρήστες
- (Τhen) τότε οι χρήστες λαμβάνουν σε προσωπικό μήνυμα τις προσφορές.
