Feature: Τροποποίηση παραγγελίας

- (Αs) Ως χρήστης πελάτης
- (In order to) Για να αλλάξω μερικά από τα στοιχεία της παραγγελίας
- (Ι want to) Θέλω να τροποποιήσω τα στοιχεία παράδοσης και αποστολής της παραγγελίας. 

Σενάριο 22.2  (Τροποποίηση παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει μία παραγγελία προϊόντος επιτυχημένα και έχω λάβει ηλεκτρόνικη απόδειξη/κωδικό παραγγελίας στα εισερχόμενά μου
- (When) Όταν πηγαίνω στην ενότητα “προφίλ μου”
- (And) Και ανοίξω το μήνυμα που έχω λάβει με τον κωδικό παραγγελίας
- (Then) Τότε πρέπει να εμφανιστούν οι πληροφορίες σχετικά με την παραγγελία και τα στοιχεία παράδοσης και αποστολής
- (And) Και η δυνατότητα για τροποποίηση των στοιχείων αυτών με την εντολή “επεξεργασία παραγγελίας”
- (When) Όταν κάνω κλικ στην επιλογή “επεξεργασία παραγγελίας”
- (Then) Τότε πρέπει να εμφανιστεί η φόρμα στοιχείων παράδοσης και αποστολής
- (When) Όταν αλλάξω τα στοιχεία που επιθυμώ 
- (And) Και κάνω κλικ στην επιλογή “αποθήκευση”
- (And) Και εμφανιστεί η ειδοποίηση “η επεξεργασία έγινε επιτυχώς”
- (Τhen) Τότε η τροποποίηση της παραγγελίας ολοκληρώθηκε επιτυχημένα.

22.3 (Αποτυχήμενη Τροποποίηση παραγγελίας)

- (Given) Θεωρώντας ότι έχω κάνει μία παραγγελία προϊόντος επιτυχημένα, έχω ανοίξει το μήνυμα που έχω λάβει με την ηλεκτρόνικη απόδειξη/κωδικό παραγγελίας στα εισερχόμενα του προφίλ και έχω επιλέξει “επεξεργασία παραγγελίας”
- (When) Όταν αλλάξω τα στοιχεία που επιθυμώ 
- (And) Και κάνω κλικ στην επιλογή “αποθήκευση”
- (And) Και εμφανιστεί το μήνυμα “ μη δυνότητα τροποποίησης - παρακαλώ επικοινωνήστε με το κατάστημα”
- (Τhen) Τότε η τροποποίηση στοιχείων ολοκληρώθηκε μη επιτυχώς.
