Feature: Παραγγελία χρήστη 

- (Αs) Ως χρήστης πελάτης
- (In order to) Για να αγοράσω το προϊόν που μ’ ενδιαφέρει
- (I want to) Θέλω να κάνω μία παραγγελία 

Σενάριο 22.1 (Κάνοντας μία παραγγελία)

- (Given) Δεδομένου ότι έχω συνδεθεί στο σύστημα ως πελάτης και μ’ ενδιαφέρει ένα προϊόν, έχω κάνει αναζήτηση για αυτό και έχει εμφανιστεί στα αποτελέσματα της αναζήτησης.
- (When) Όταν κάνω κλικ πάνω στο εικονίδιο του προϊόντος.
- (Then) Τότε πρέπει να εμφανιστούν τα καταστήματα που το διαθέτουν 
- (When) Όταν επιλέξω το κατάστημα απ’ όπου θέλω να γίνει η αγορά.
- (Then) Τότε πρέπει να εμφανιστεί το εικονίδιο  προσθήκη στο καλάθι αγορών.
- (And) Και κάνοντας κλικ προσθέτει το προϊόν στο καλάθι αγορών 
- (When) Όταν πηγαίνω στο καλάθι αγορών
- (And) Και επιλέξω ολοκλήρωση παραγγελίας
- (Τhen) Τότε πρέπει να εφανιστεί ένα πλαίσιο για να συπληρώσω τα στοιχεία αποστολής και να επιλέξω τον τρόπο πληρωμής του προϊόντος
- (When) Όταν καταχωρήσω τα στοιχεία και επιλέξω τον τρόπο πληρωμής 
- (And) Kαι πατήσω στην εντολή «οκ»
- (Then) Τότε πρέπει να εμφανιστεί ένα μήνυμα ότι η παραγγελία ολοκληρώθηκε επιτυχώς
- (And) Και ένα μήνυμα-ηλεκτρονική απόδειξη/κωδικός παραγγελίας πρέπει να αποσταλεί στην ενότητα «εισερχόμενα».
