Feature: Αποσύνδεση χρήστη

- (As) Ως χρήστης πελάτης/διαχειριστής/κατάστημα/επισκέπτης
- (In order to) Για να προστατεύσω τα προσωπικά μου δεδομένα
- (Ι want to) Θέλω να μπορώ να κάνω αποσύνδεση από το σύστημα.

Σενάριο 23.1 (Αποσύνδεση χρήστη)

- (Given) Θεωρώντας ότι κάνω περιήγηση στο σύστημα και θέλω να αποσυνδεθώ
- (When) Όταν επιλέξω <<Αποσύνδεση>>
- (And) Και εμφανιστεί το μήνυμα επιβεβαίωσης της αποσύνδεσης
- (And) Και επιλέξω <<ναι>>
- (Τhen) Τότε εμφανίζεται η σελίδα της ταυτοποίησης του συστήματος.

Σενάριο 23.2 (Αποτυχία αποσύνδεσης χρήστη)

- (Given) Θεωρώντας ότι κάνω περιήγηση στο σύστημα και θέλω να αποσυνδεθώ
- (When) Όταν επιλέξω <<Αποσύνδεση>>
- (And) Και εμφανιστεί το μήνυμα επιβεβαίωσης της αποσύνδεσης
- (And) Και επιλέξω <<όχι>>
- (Τhen) Τότε εμφανίζεται η σελίδα στην οποία βρισκόμουν πιο πριν.
