Feature: Μουσικά νέα

- (As) Ως χρήστης πελάτης/επισκέπτης
- (In order to) Για να έχω ακόμα ένα κίνητρο επίσκεψης στο σύστημα 
- (Ι want to) Θέλω να γίνεται ενημέρωση για επιλεγμένα μουσικά νέα στην αρχική του οθόνη.

Σενάριο 24.1 (Μουσικά νέα)

- (Given) Θεωρώντας ότι κάνω περιήγηση στο σύστημα
- (When) Όταν εμφανίζονται στην αρχική οθόνη διάφορα μουσικά νέα
- (Τhen) Τότε το σύστημα έχει δημοσιεύσει τα μουσικά νέα.

Σενάριο 24.2 (Διαγραφή μουσικών νέων)

- (Given) Θεωρώντας ότι κάνω περιήγηση στο σύστημα
- (When) Όταν δεν εμφανίζονται μουσικά νέα στην αρχική οθόνη
- (Τhen) Τότε το σύστημα δεν έχει δημοσιεύσει μουσικά νέα εδώ και 15 ημέρες.
