Feature: Kατηγορίες

-  (Αs) Ως χρήστης πελάτης/επισκέπτης
-  (In order to) Για να αναζήτησω ένα προϊόν με βάση μία κατηγορία προϊόντων
-  (I want to) Θέλω να ενημερωθώ για τις διαθέσιμες κατηγόριες προϊόντων

Σενάριο 3.1 (Κατηγορίες προϊόντων)

-  (Given) Θεωρώντας ότι έχω πληκτρολογήσει σωστά το domain name του ιστότοπου και έχει εμφανιστεί η σελίδα κεντρικής εισόδου στο σύστημα
-  (When) Όταν κάνω είσοδο στο σύστημα
-  (And) Και μεταφερθώ στην αρχική σελίδα της εφαρμογής
-  (Then) Τότε στο μενού τηςς οθόνης πρέπει να εμφανιστούν οι διαθέσιμες κατηγορίες προϊόντων

Σενάριο 3.2 (Περιήγηση στις κατηγορίες προϊόντων)

-  (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα 
-  (When) Όταν πηγαίνω  στον πίνακα με τις διαθέσιμες κατηγορίες στα αριστερά της αρχικής σελίδας
-  (And) Kαι κάνω κλικ στην κατηγορία που μ’ ενδιαφέρει
-  (Τhen) Τότε πρέπει να εμφανιστούν όλα τα προϊόντα που υπάρχουν καταχωρημένα στο σύστημα στην επιλεγμένη κατηγορία
