Feature: Νέο προϊόν

- (Αs) Ως χρήστης κατάστημα
- (In order to) Για να ενημερώσω το σύστημα για ένα καινούργιο προϊόν
- (Ι want to) Θέλω να καταχωρήσω το προϊόν. 

Σενάριο 4  (Καταχώρηση ενός προϊόντος)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα 
- (When) Όταν επιλέξω την λειτουργία καταχώρηση
- (Αnd) Kαι καταχωρήσω το προϊόν που επιθυμώ 
- (Αnd) Και ενημερώνω το σύστημα με πληροφορίες σχετικά με την διαθεσιμότητα και την τιμή του
- (And) Και επιλέξω επιβεβαίωση
- (Then) Τότε το προϊόν καταχωρήθηκε και ενημερώθηκε το σύστημα για το προϊόν αυτό.
