Feature: Mη διαθέσιμο προϊόν

- (Αs) Ως χρήστης κατάστημα
-	(In order to) Για να είναι ενημερωμένο το σύστημα και όλες οι πληροφορίες που είναι αναρτημένες στο σύστημα να είναι έγκυρες 
- (Ι want to) Θέλω να ενημερώσω το σύστημα ότι δεν μπορώ να ανταποκριθώ σε ενδεχόμενη παραγγελία από πελάτες λόγω ξαφνικής έλλειψης απόθεματος

Σενάριο 5.4 (Ενημέρωση μη διαθεσιμότητας ενός προϊόντος)

- (Given) Θεωρώντας ότι έχω συνδεθεί ως χρήστης κατάστημα και  έχω καταχωρήσει ένα προϊόν στο σύστημα
- (When) Όταν πηγαίνω στο «προφίλ»
-	(Then) Τότε πρέπει να εμφανιστεί μια λίστα με όλα τα προϊόντα που έχω αναρτήσει στο σύστημα ανα κατηγορία.
-	(When) Όταν επιλέξω το προϊόν που θέλω να ενημερώσω τη διαθεσιμότητά του 
-	(Then) Τότε πρέπει να εμφανιστούν όλες οι πληροφορίες σχετικά με το προϊόν που έχω αναρτήσει
-	(When) Όταν κάνω κλικ στην λειτουργία “ενημέρωση διαθεσιμότητας”
- (And) Και καταχωρήσω “μηδενική” διαθεσιμότητα προϊόντος
-	(And) Και επιλέξω “επιβεβαίωση”
-	(Then) Τότε η διαθεσιμότητα ενημερώθηκε στο σύστημα
-	(And) Και πρέπει να εμφανιστεί δίπλα στο προϊόν το μήνυμα “κατόπιν παραγγελίας”.
