Feature: Επεξεργασία/ διαγραφή

- (Αs) Ως χρήστης κατάστημα
- (In order to) Για να είναι ενημερωμένο το σύστημα.
- (Ι want to) Θέλω να επεξεργαστώ  ή να διαγράψω ένα προϊόν ώστε όλες οι πληροφορίες που είναι αναρτημένες στο σύστημα να είναι έγκυρες. 

Σενάριο 5.1 (Επεξεργασία προϊόντων)

- (Given) Θεωρώντας ότι είμαι συνδεδεμένος ως κατάστημα
- (When) Όταν πηγαίνω στο «προφίλ»
- (Then) Τότε πρέπει να εμφανιστεί μια λίστα με όλα τα προϊόντα που έχω αναρτήσει στο σύστημα ανα κατηγορία.
- (When) Όταν επιλέξω το προϊόν που θέλω να επεξεργαστώ 
- (Then) Τότε θα πρέπει να εμφανιστούν όλες οι πληροφορίες σχετικά με το προϊόν που έχω αναρτήσει
- (When) Όταν επιλέξω επεξεργασία
- (And) Και τροποποιήσω τα στοιχεία που επιθυμώ
- (And) Και κάνω κλικ σε “ενημέρωση”
- (Τhen) Τότε πρέπει να ενημερωθούν οι πληροφορίες του προϊόντος στη βάση δεδομένων του συστήματος.
- (Αnd) Και να εμφανιστεί το προϊόν με τις αλλαγές που έχω κάνει.

5.2 (Διαγραφή προϊόντων)

- (Given) Θεωρώντας ότι εμφανίζονται στο σύστημα τα προϊόντα που έχω αναρτήσει
- (When) Όταν επιλέξω το προϊόν
- (And) Και πατήσω “διαγραφή”
- (And) Και επιλέξω “επιβεβαίωση”
- (Then) Τότε πρέπει να διαγραφεί το προϊόν από τη βάση δεδομένων 
- (And) Και να εμφανιστεί το μήνυμα “Η διαγραφή πραγματοποιήθηκε”.
