 Feature: Πληροφορίες
 
- (Αs) Ως χρήστης κατάστημα
- (In order to) Για να γνωρίζει ο χρήστης πελάτης/επισκέπτης πληροφορίες σχετικά με το προϊόν που έχω ανεβάσει
-	(Ι want to) Θέλω να ανεβάσω μια περιγραφή και πληροφορίες (isbn, εκδόσεις, έτος έκδοσης, σελίδες κλπ) για το προϊόν

Σενάριο 6  (Πληροφορίες για ένα προϊόν)

- (Given) Θεωρώντας ότι έχω καταχωρήσει ένα προϊόν και θέλω ο χρήστης       πελάτης να γνωρίζει πληροφορίες σχετικά με αυτό. 
- (When) Όταν πηγαίνω στο «προφίλ»
- (Then) Τότε πρέπει να εμφανιστεί μια λίστα με όλα τα προϊόντα που έχω αναρτήσει στο σύστημα ανα κατηγορία.
- (When) Όταν επιλέξω το προϊόν που θέλω να προσθέσω πληροφορίες
- (And) Και επιλέξω την λειτουργία “καταχώρηση περιγραφής”
- (And) Και επιλέξω τα αρχεία κειμένου, εικόνας κλπ που θέλω να ανεβάσω 
- (And) Και πατήσω την εντολή “ενημέρωση”
- (Then) Τότε πρέπει να εμφανιστεί ένα μήνυμα επιτυχούς ολοκλήρωσης της διαδικασίας
- (And) Και να εμφανιστουν οι πληροφορίες, περιγραφή και εικόνες δίπλα στο προϊόν που έχω καταχωρήσει.
