Feature: Προτιμήσεις χρηστών

- (Αs) Ως χρήστης πελάτης/επισκέπτης
- (In order to) Για να ενημερώνεται ο χρήστης/πελάτης για τα δημοφιλή προϊόντα
- (I want to) Θέλω να ενημερωθώ για τις προτιμήσεις των άλλων χρηστών σε αυτή τη κατηγορία

Σενάριο 8 (Δημοφιλή προϊόντα)

- (Given) Θεωρώντας ότι έχω επιλέξει την κατηγορία προϊόντων που μ’ ενδιαφέρει και έχει εμφανιστεί μια λίστα προϊόντων της εκάστοτε κατηγορίας
- (When) Όταν πηγαίνω στην λίστα με τα προϊόντα
- (Then) Τότε επάνω από τη λίστα πρέπει να εμφανίστούν τρεις επιλογές: “δημοτικότητα”, “αύξουσα τιμή”, “βαθμολογία”
- (When) Όταν κάνω κλικ στην επιλογή “δημοτικότητα”
- (Then) Τότε η λίστα προϊόντων πρέπει να ανανεωθεί και να εμφανίζει  τα προϊόντα ταξινομημένα με τα πιο δημοφιλή.
