Feature:

- (Αs) Ως χρήστης πελάτης/επισκέπτης
- (In order to) Για να αναζητήσω ένα προϊόν που μ ενδιαφέρει
- (I want to) Θέλω να κάνω αναζήτηση 

Σενάριο 9.1 (Κάνοντας αναζήτηση)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα
- (When) Όταν πηγαίνω στην μπάρα της αναζήτησης
- (Αnd) Και πληκτρολογήσω λέξεις αναφορικά με το προϊόν που μ’ ενδιαφέρει
- (Then) Τότε πρέπει να εμφανιστούν μια σειρά από αποτελέσματα

Σενάριο 9.2 (Aναζήτηση χωρίς αποτελέσματα)

- (Given) Θεωρώντας ότι έχω κάνει είσοδο στο σύστημα
- (When) Όταν κάνω αναζήτηση 
- (Αnd) Και πληκτρολογήσω λέξεις αναφορικά με το προϊόν που μ’ ενδιαφέρει
- (Αnd) Και δεν υπάρχουν συμβατά αποτελέσματα
- (Then) Τότε πρέπει να εμφανιστεί το μήνυμα “δεν βρέθηκαν αποτελέσματα”.
