Feature: Ταυτοποίηση
(As) Ως χρήστης πελάτης/κατάστημα/διαχειριστής/επισκέπτης
(In order to) Για να εξερευνήσω τις δυνατότητες του συστήματος
(Ι want to) Θέλω να πλοηγηθώ εντός της αρχικής σελίδας.

Σενάριο 1.1 (Είσοδος – χρήστη πελάτη)

(Given) Θεωρώντας ότι πρέπει να κάνω ταυτοποίηση κατά την είσοδό μου στο σύστημα
(When) Όταν πληκτρολογήσω το Όνομα χρήστη και τον Κωδικό μου 
(And) Και επιλέξω Είσοδος
(Τhen) Τότε πρέπει να εμφανιστεί η αρχική σελίδα του συστήματος.












